app/views/projects/index.html.erb

                <td>
                  <% if project.project_status.present? %>
---
SELECT "projects".* FROM "projects"