app/controllers/api/v1/projects_controller.rb

INSERT INTO "projects" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-03-01 12:37:45.126075"], ["updated_at", "2021-03-01 12:37:45.126075"]]
---
   def create
	   @project = Project.new(project_params)
	   if @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
   def show
		projects = Project.find_by_id(params[:id])