app/controllers/projects_controller.rb

  def create
    @project = current_user.projects.build(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("project_name", "client_name", "developer", "start_date", "working_hours", "payment_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "project_name" = $1, "client_name" = $2, "developer" = $3, "start_date" = $4, "working_hours" = $5, "payment_date" = $6, "updated_at" = $7 WHERE "projects"."id" = $8

    def set_project
      @project = current_user.projects.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]